InformationRegisters/гф_ПричиныБлокировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>гф_ПричиныБлокировок</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заблокирован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБлокировки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыБлокировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/гф_БлокировкаКонтрагентов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// #wortmann {
// #Формирование установки блокировки договора с описанием вида блокировки при проведении документа блокировка
// описание вставки
// Галфинд(Просто) Боцманова 2022/09/06
//
// Осуществляет заполненнение данных документа.
//
// Параметры:
//   Источник - ДокументОбъект - Обрабатываемый объект.
//   Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//   РежимПроведения - - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
Процедура гф_УстановкаБлокировкиДоговоровКонтрагентаОбработкаПроведения1(Источник, Отказ, РежимПроведения) Экспорт
	// vvv Галфинд \ Sakovich 06.03.2024
	//Если ЗначениеЗаполнено(Источник.ДоговорКонтрагента) Тогда 
	//	Если  НЕ Источник.Исключения Тогда
	//		Если Источник.Заблокирован Тогда 
	//			ДоговорКонтрагента = Источник.ДоговорКонтрагента;
	//			ДоговорДляИзменения = ДоговорКонтрагента.ПолучитьОбъект(); 
	//			Если СтрНайти(ДоговорДляИзменения.гф_ОписаниеБлокировки,Источник.ВидБлокировки)=0 тогда
	//				ДоговорДляИзменения.гф_Заблокирован = Истина; 
	//				Если  НЕ ЗначениеЗаполнено(ДоговорДляИзменения.гф_ОписаниеБлокировки) Тогда
	//					ДоговорДляИзменения.гф_ОписаниеБлокировки  = Источник.ВидБлокировки;
	//				Иначе 
	//					ДоговорДляИзменения.гф_ОписаниеБлокировки  = ДоговорДляИзменения.гф_ОписаниеБлокировки
	//					+ "; " + Источник.ВидБлокировки;
	//				КонецЕсли;
	//				ДоговорДляИзменения.Записать();  
	//			КонецЕсли;
	//		Иначе
	//			ДоговорКонтрагента = Источник.ДоговорКонтрагента;
	//			УстановкаБлокировкиДоговораКонтрагента(ДоговорКонтрагента, Источник);			
	//		КонецЕсли; 
	//	КонецЕсли; 
	//Иначе
	//	ЗаполнениеБлокировкиПоВсеДоговорамКонтрагента(Источник);		
	//КонецЕсли;
	
	ЗаполнениеБлокировкиПоВсемДоговорамПартнера(Источник, Отказ);
	// ^^^ Галфинд \ Sakovich 06.03.2024
КонецПроцедуры  

// vvv Галфинд \ Sakovich 15.03.2024
Процедура гф_УдалениеБлокировкиДоговоровКонтрагентаОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	ЗаполнениеБлокировкиПоВсемДоговорамПартнера(Источник, Отказ);
КонецПроцедуры // ^^^ Галфинд \ Sakovich 15.03.2024

 #КонецОбласти  
 
#Область СлужебныеПроцедурыИФункции  

// #wortmann {
// #Формирование установки блокировки договора с описанием вида блокировки при проведении документа блокировка
// описание вставки
// Галфинд(Просто) Боцманова 2022/09/07
//
// Осуществляет заполненнение данных документа.
//
// Параметры:
//   Источник,ДоговорКонтрагента
 Процедура УстановкаБлокировкиДоговораКонтрагента(ДоговорКонтрагента, Источник)
	
	ДоговорДляИзменения = ДоговорКонтрагента.ПолучитьОбъект(); 
	ЗначенияБлокировки  =  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок
	(ДоговорДляИзменения.гф_ОписаниеБлокировки, "; ");
	Если ЗначенияБлокировки.Количество()  = 1  Тогда
		ДоговорДляИзменения.гф_Заблокирован = Ложь;
		ДоговорДляИзменения.гф_ОписаниеБлокировки  = "";
	Иначе
		ДоговорДляИзменения.гф_ОписаниеБлокировки  = СтрЗаменить
		(ДоговорДляИзменения.гф_ОписаниеБлокировки, Источник.ВидБлокировки , "");
		Если СтрНайти(ДоговорДляИзменения.гф_ОписаниеБлокировки , "; ;") <> 0 Тогда
			ДоговорДляИзменения.гф_ОписаниеБлокировки  = СтрЗаменить(ДоговорДляИзменения.гф_ОписаниеБлокировки , "; ;", ";");
		КонецЕсли;
		Если СтрНайти(ДоговорДляИзменения.гф_ОписаниеБлокировки , "; ") <> 0 Тогда
			ДоговорДляИзменения.гф_ОписаниеБлокировки  = СтрЗаменить(ДоговорДляИзменения.гф_ОписаниеБлокировки , "; " , "");
		КонецЕсли;
			
	КонецЕсли;
	
	ДоговорДляИзменения.Записать();	  
	
КонецПроцедуры

// #wortmann {
// #Формирование установки блокировки договора с описанием вида блокировки по всем договорам контрагента
// описание вставки
// Галфинд(Просто) Боцманова 2022/09/07
// Параметры:
//   Источник - ДокументОбъект - Обрабатываемый объект. 
Процедура ЗаполнениеБлокировкиПоВсеДоговорамКонтрагента(Источник)  
	
	Запрос  =  Новый Запрос;
	Запрос.Текст  =  
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Партнер  =  &Контрагент
	// СадомцевСА 08.02.2024 Не учитываем "НЕ сезонные" договоры
	// при проведении документа гф_БлокировкаРазблокировкаОтгрузок
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eeac0cd3cfa650
	|	И ДоговорыКонтрагентов.гф_Сезон <> ЗНАЧЕНИЕ(Справочник.КоллекцииНоменклатуры.ПустаяСсылка)	
	|	И ДоговорыКонтрагентов.Организация  =  &Организация";
	Если НЕ Значениезаполнено(Источник.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДоговорыКонтрагентов.Организация  =  &Организация", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("Контрагент", Источник.Партнер);
	Запрос.УстановитьПараметр("Организация", Источник.Организация);
	
	РезультатЗапроса  =  Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи  =  РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Если НЕ Источник.Исключения Тогда
		Если Источник.Заблокирован Тогда 
			ДоговорКонтрагента = ВыборкаДетальныеЗаписи.Ссылка;
			ДоговорДляИзменения = ДоговорКонтрагента.ПолучитьОбъект();
			Если СтрНайти(ДоговорДляИзменения.гф_ОписаниеБлокировки,Источник.ВидБлокировки)=0 тогда
			ДоговорДляИзменения.гф_Заблокирован = Истина; 
			Если  НЕ ЗначениеЗаполнено(ДоговорДляИзменения.гф_ОписаниеБлокировки) Тогда
				ДоговорДляИзменения.гф_ОписаниеБлокировки  = Источник.ВидБлокировки;
			Иначе 
				ДоговорДляИзменения.гф_ОписаниеБлокировки  = ДоговорДляИзменения.гф_ОписаниеБлокировки 
				+ "; " + Источник.ВидБлокировки;
			КонецЕсли;
			ДоговорДляИзменения.Записать(); 
			КонецЕсли;
		Иначе
			ДоговорКонтрагента = ВыборкаДетальныеЗаписи.Ссылка;
			УстановкаБлокировкиДоговораКонтрагента(ДоговорКонтрагента, Источник);				
		КонецЕсли;
	КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры 

// vvv Галфинд \ Sakovich 06.03.2024
Процедура ЗаполнениеБлокировкиПоВсемДоговорамПартнера(Источник, Отказ)
	Партнер = Источник.Партнер;
	Период = ТекущаяДатаСеанса();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.гф_ПричиныБлокировок");
	ЭлементБлокировки.УстановитьЗначение("Партнер", Партнер);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	ДвиженияПричиныБлокировок = Источник.Движения["гф_ПричиныБлокировок"];
	ДвиженияПричиныБлокировок.Записать();
	
	ДанныеВыборка = ПолучитьДанныеПоБлокировкамПоПартнеру(Партнер, Период);
	тзДанныеПоИсключениям = ПолучитьДанныеПоИсключениямПоПартнеру(Партнер, НачалоДня(Период));
	Если ДанныеВыборка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Пока ДанныеВыборка.Следующий() Цикл
		Если Не ДанныеВыборка["ОжидаетсяБлокировка"] Тогда
			ДоговорДляИзменения = ДанныеВыборка["ДоговорКандидат"].ПолучитьОбъект();
			ДоговорДляИзменения["гф_Заблокирован"] = Ложь;
			ДоговорДляИзменения["гф_ОписаниеБлокировки"]= "";
			Если тзДанныеПоИсключениям.Количество() > 0 Тогда
				мОписанийИсключений = Новый Массив;
				стрПоиска = Новый Структура("ДоговорКандидат", ДанныеВыборка["ДоговорКандидат"]);
				мСтрокПоИсключениям = тзДанныеПоИсключениям.НайтиСтроки(стрПоиска);
				Для каждого стрИсключение Из мСтрокПоИсключениям Цикл
					мОписанийИсключений.Добавить(СокрЛП(стрИсключение["ОписаниеБлокировки"]));
				КонецЦикла;
				ОписаниеИсключений = СокрЛП(СтрСоединить(мОписанийИсключений, "; "));
				ДоговорДляИзменения["гф_ОписаниеБлокировки"]= ОписаниеИсключений;
			КонецЕсли;
			
			Попытка
				ДоговорДляИзменения.Записать();
			Исключение
				ОбщегоНазначения.СообщитьПользователю("Не удалось записать договор: " + ДанныеВыборка["ДоговорКандидат"] + 
				" Партнер: " + Партнер, , , , Отказ);
			КонецПопытки;
		Иначе
			СтруктураРеквизитовБлокировки = 
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеВыборка["ДоговорКандидат"], "гф_Заблокирован, гф_ОписаниеБлокировки");
			ВыборкаДетали = ДанныеВыборка.Выбрать();
			МассивОписанийБлокировок = Новый Массив;
			Пока ВыборкаДетали.Следующий() Цикл
				МассивОписанийБлокировок.Добавить(СокрЛП(ВыборкаДетали["ОписаниеБлокировки"]));
			КонецЦикла;
			Если тзДанныеПоИсключениям.Количество() > 0 Тогда
				стрПоиска = Новый Структура("ДоговорКандидат", ДанныеВыборка["ДоговорКандидат"]);
				мСтрокПоИсключениям = тзДанныеПоИсключениям.НайтиСтроки(стрПоиска);
				Для каждого стрИсключение Из мСтрокПоИсключениям Цикл
					МассивОписанийБлокировок.Добавить(СокрЛП(стрИсключение["ОписаниеБлокировки"]));
				КонецЦикла;
			КонецЕсли;
			ОписаниеБлокировкиКандидат = СокрЛП(СтрСоединить(МассивОписанийБлокировок, "; "));
			Если Не СтруктураРеквизитовБлокировки["гф_Заблокирован"] ИЛИ
				СтруктураРеквизитовБлокировки["гф_ОписаниеБлокировки"] <> ОписаниеБлокировкиКандидат Тогда
				ДоговорДляИзменения = ДанныеВыборка["ДоговорКандидат"].ПолучитьОбъект();
				ДоговорДляИзменения["гф_Заблокирован"] = Истина;
				ДоговорДляИзменения["гф_ОписаниеБлокировки"]= ОписаниеБлокировкиКандидат;
				Попытка
					ДоговорДляИзменения.Записать();
				Исключение
					ОбщегоНазначения.СообщитьПользователю("Не удалось записать договор: " + ДанныеВыборка["ДоговорКандидат"] + 
					" Партнер: " + Партнер, , , , Отказ);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ^^^ Галфинд \ Sakovich 06.03.2024

// vvv Галфинд \ Sakovich 06.03.2024
Функция ПолучитьДанныеПоБлокировкамПоПартнеру(Партнер, Период)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК нпп_Блокировки,
	|	рсБлокировки.Период КАК Период,
	|	рсБлокировки.Контрагент КАК Контрагент,
	|	рсБлокировки.Партнер КАК Партнер,
	|	рсБлокировки.Организация КАК Организация,
	|	рсБлокировки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	рсБлокировки.ВидБлокировки КАК ВидБлокировки,
	|	рсБлокировки.Заблокирован КАК Заблокирован,
	|	ДоговорыКонтрагентов.Ссылка КАК спрДоговор,
	|	ДоговорыКонтрагентов.гф_Заблокирован КАК спр_Заблокирован,
	|	ДоговорыКонтрагентов.гф_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ Блокировки
	|ИЗ
	|	РегистрСведений.гф_ПричиныБлокировок.СрезПоследних(&Период, Партнер = &Партнер) КАК рсБлокировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (рсБлокировки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
	|ГДЕ
	|	рсБлокировки.Заблокирован
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Блокировки.нпп_Блокировки КАК нпп_Блокировки,
	|	Блокировки.Период КАК Период,
	|	Блокировки.Контрагент КАК Контрагент,
	|	Блокировки.Партнер КАК Партнер,
	|	Блокировки.Организация КАК Организация,
	|	Блокировки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Блокировки.ВидБлокировки КАК ВидБлокировки,
	|	Блокировки.Заблокирован КАК Заблокирован,
	|	ДоговорыКонтрагентов.Ссылка КАК спрДоговор,
	|	ДоговорыКонтрагентов.гф_Заблокирован КАК спр_Заблокирован,
	|	ДоговорыКонтрагентов.гф_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ вт_БлокировкиПоПартнеру
	|ИЗ
	|	Блокировки КАК Блокировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Блокировки.Партнер = ДоговорыКонтрагентов.Партнер
	|ГДЕ
	|	Блокировки.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И НЕ ДоговорыКонтрагентов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Блокировки.нпп_Блокировки КАК нпп_Блокировки,
	|	Блокировки.Период КАК Период,
	|	Блокировки.Контрагент КАК Контрагент,
	|	Блокировки.Партнер КАК Партнер,
	|	Блокировки.Организация КАК Организация,
	|	Блокировки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Блокировки.ВидБлокировки КАК ВидБлокировки,
	|	Блокировки.Заблокирован КАК Заблокирован,
	|	ДоговорыКонтрагентов.Ссылка КАК спрДоговор,
	|	ДоговорыКонтрагентов.гф_Заблокирован КАК спр_Заблокирован,
	|	ДоговорыКонтрагентов.гф_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ вт_БлокировкиПоОрганизации
	|ИЗ
	|	Блокировки КАК Блокировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Блокировки.Партнер = ДоговорыКонтрагентов.Партнер
	|			И Блокировки.Организация = ДоговорыКонтрагентов.Организация
	|ГДЕ
	|	Блокировки.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	И НЕ ДоговорыКонтрагентов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И НЕ Блокировки.нпп_Блокировки В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т.нпп_Блокировки
	|				ИЗ
	|					вт_БлокировкиПоПартнеру КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Блокировки.нпп_Блокировки КАК нпп_Блокировки,
	|	Блокировки.Период КАК Период,
	|	Блокировки.Контрагент КАК Контрагент,
	|	Блокировки.Партнер КАК Партнер,
	|	Блокировки.Организация КАК Организация,
	|	Блокировки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Блокировки.ВидБлокировки КАК ВидБлокировки,
	|	Блокировки.Заблокирован КАК Заблокирован,
	|	ДоговорыКонтрагентов.Ссылка КАК спрДоговор,
	|	ДоговорыКонтрагентов.гф_Заблокирован КАК спр_Заблокирован,
	|	ДоговорыКонтрагентов.гф_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ вт_БлокировкиПоДоговорам
	|ИЗ
	|	Блокировки КАК Блокировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Блокировки.Партнер = ДоговорыКонтрагентов.Партнер
	|			И Блокировки.Организация = ДоговорыКонтрагентов.Организация
	|			И Блокировки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	НЕ Блокировки.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	И НЕ ДоговорыКонтрагентов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И НЕ Блокировки.нпп_Блокировки В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т.нпп_Блокировки
	|				ИЗ
	|					вт_БлокировкиПоПартнеру КАК т)
	|	И НЕ Блокировки.нпп_Блокировки В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т1.нпп_Блокировки
	|				ИЗ
	|					вт_БлокировкиПоОрганизации КАК т1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_БлокировкиПоПартнеру.нпп_Блокировки КАК нпп_Блокировки,
	|	вт_БлокировкиПоПартнеру.Период КАК Период,
	|	вт_БлокировкиПоПартнеру.Контрагент КАК Контрагент,
	|	вт_БлокировкиПоПартнеру.Партнер КАК Партнер,
	|	вт_БлокировкиПоПартнеру.Организация КАК Организация,
	|	вт_БлокировкиПоПартнеру.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	вт_БлокировкиПоПартнеру.ВидБлокировки КАК ВидБлокировки,
	|	вт_БлокировкиПоПартнеру.Заблокирован КАК Заблокирован,
	|	вт_БлокировкиПоПартнеру.спрДоговор КАК спрДоговор,
	|	вт_БлокировкиПоПартнеру.спр_Заблокирован КАК спр_Заблокирован,
	|	вт_БлокировкиПоПартнеру.спр_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ вт_БлокировкиСводно
	|ИЗ
	|	вт_БлокировкиПоПартнеру КАК вт_БлокировкиПоПартнеру
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_БлокировкиПоОрганизации.нпп_Блокировки,
	|	вт_БлокировкиПоОрганизации.Период,
	|	вт_БлокировкиПоОрганизации.Контрагент,
	|	вт_БлокировкиПоОрганизации.Партнер,
	|	вт_БлокировкиПоОрганизации.Организация,
	|	вт_БлокировкиПоОрганизации.ДоговорКонтрагента,
	|	вт_БлокировкиПоОрганизации.ВидБлокировки,
	|	вт_БлокировкиПоОрганизации.Заблокирован,
	|	вт_БлокировкиПоОрганизации.спрДоговор,
	|	вт_БлокировкиПоОрганизации.спр_Заблокирован,
	|	вт_БлокировкиПоОрганизации.спр_ОписаниеБлокировки
	|ИЗ
	|	вт_БлокировкиПоОрганизации КАК вт_БлокировкиПоОрганизации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_БлокировкиПоДоговорам.нпп_Блокировки,
	|	вт_БлокировкиПоДоговорам.Период,
	|	вт_БлокировкиПоДоговорам.Контрагент,
	|	вт_БлокировкиПоДоговорам.Партнер,
	|	вт_БлокировкиПоДоговорам.Организация,
	|	вт_БлокировкиПоДоговорам.ДоговорКонтрагента,
	|	вт_БлокировкиПоДоговорам.ВидБлокировки,
	|	вт_БлокировкиПоДоговорам.Заблокирован,
	|	вт_БлокировкиПоДоговорам.спрДоговор,
	|	вт_БлокировкиПоДоговорам.спр_Заблокирован,
	|	вт_БлокировкиПоДоговорам.спр_ОписаниеБлокировки
	|ИЗ
	|	вт_БлокировкиПоДоговорам КАК вт_БлокировкиПоДоговорам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_БлокировкиСводно.нпп_Блокировки КАК нпп_Блокировки,
	|	вт_БлокировкиСводно.Период КАК Период,
	|	вт_БлокировкиСводно.Контрагент КАК Контрагент,
	|	вт_БлокировкиСводно.Партнер КАК Партнер,
	|	вт_БлокировкиСводно.Организация КАК Организация,
	|	вт_БлокировкиСводно.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	вт_БлокировкиСводно.ВидБлокировки КАК ВидБлокировки,	
	|	вт_БлокировкиСводно.ВидБлокировки.Наименование + ""("" + вт_БлокировкиСводно.ВидБлокировки.Код + "")"" КАК ОписаниеБлокировки,
	|	вт_БлокировкиСводно.Заблокирован КАК Заблокирован,
	|	вт_БлокировкиСводно.спрДоговор КАК спрДоговор,
	|	вт_БлокировкиСводно.спр_Заблокирован КАК спр_Заблокирован,
	|	вт_БлокировкиСводно.спр_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ вт_ИтоговыеДанныеПоБлокировкам
	|ИЗ
	|	вт_БлокировкиСводно КАК вт_БлокировкиСводно
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	спрДоговор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКандидат,
	|	ВЫБОР
	|		КОГДА вт_ИтоговыеДанныеПоБлокировкам.нпп_Блокировки ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОжидаетсяБлокировка,
	|	ВЫБОР
	|		КОГДА вт_ИтоговыеДанныеПоБлокировкам.нпп_Блокировки ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ДоговорыКонтрагентов.гф_Заблокирован
	|						ТОГДА ВЫБОР
	|								КОГДА ДоговорыКонтрагентов.гф_ОписаниеБлокировки = """"
	|									ТОГДА ЛОЖЬ
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Обработать,
	|	вт_ИтоговыеДанныеПоБлокировкам.ОписаниеБлокировки КАК ОписаниеБлокировки
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ИтоговыеДанныеПоБлокировкам КАК вт_ИтоговыеДанныеПоБлокировкам
	|		ПО (ДоговорыКонтрагентов.Ссылка = вт_ИтоговыеДанныеПоБлокировкам.спрДоговор)
	|ГДЕ
	|	ДоговорыКонтрагентов.Партнер = &Партнер
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И НЕ ДоговорыКонтрагентов.гф_Сезон = ЗНАЧЕНИЕ(Справочник.КоллекцииНоменклатуры.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА вт_ИтоговыеДанныеПоБлокировкам.нпп_Блокировки ЕСТЬ NULL
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ ДоговорыКонтрагентов.гф_Заблокирован
	|							ТОГДА ВЫБОР
	|									КОГДА ДоговорыКонтрагентов.гф_ОписаниеБлокировки = """"
	|										ТОГДА ЛОЖЬ
	|									ИНАЧЕ ИСТИНА
	|								КОНЕЦ
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОжидаетсяБлокировка
	|ИТОГИ
	|	МАКСИМУМ(ОжидаетсяБлокировка),
	|	МАКСИМУМ(Обработать)
	|ПО
	|	ДоговорКандидат
	|";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Период", Период);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Возврат ВыборкаИтоги;
КонецФункции // ^^^ Галфинд \ Sakovich 06.03.2024

// vvv Галфинд \ Sakovich 13.03.2024
Функция ПолучитьДанныеПоИсключениямПоПартнеру(Партнер, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК нпп_Блокировки,
	|	рсБлокировки.Период КАК Период,
	|	рсБлокировки.Регистратор КАК Регистратор,
	|	ЛЕВ(СТРОКА(рсБлокировки.Регистратор.ДействуетДо), 10) КАК ДействуетДо,
	|	рсБлокировки.Контрагент КАК Контрагент,
	|	рсБлокировки.Партнер КАК Партнер,
	|	рсБлокировки.Организация КАК Организация,
	|	рсБлокировки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	рсБлокировки.ВидБлокировки.Наименование + ""("" + рсБлокировки.ВидБлокировки.Код + "")"" КАК ОписаниеБлокировки,
	|	рсБлокировки.Заблокирован КАК Заблокирован,
	|	ДоговорыКонтрагентов.Ссылка КАК спрДоговор,
	|	ДоговорыКонтрагентов.гф_Заблокирован КАК спр_Заблокирован,
	|	ДоговорыКонтрагентов.гф_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ ИсключенияБлокировок
	|ИЗ
	|	РегистрСведений.гф_ПричиныБлокировок.СрезПоследних(&Период, Партнер = &Партнер) КАК рсБлокировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (рсБлокировки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка)
	|ГДЕ
	|	НЕ рсБлокировки.Заблокирован
	|	И рсБлокировки.Регистратор.Исключения
	|	И рсБлокировки.Регистратор.ДействуетДо >= &Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Блокировки.нпп_Блокировки КАК нпп_Блокировки,
	|	Блокировки.Период КАК Период,
	|	Блокировки.ДействуетДо КАК ДействуетДо,
	|	Блокировки.Контрагент КАК Контрагент,
	|	Блокировки.Партнер КАК Партнер,
	|	Блокировки.Организация КАК Организация,
	|	Блокировки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Блокировки.ОписаниеБлокировки КАК ОписаниеБлокировки,
	|	Блокировки.Заблокирован КАК Заблокирован,
	|	ДоговорыКонтрагентов.Ссылка КАК спрДоговор,
	|	ДоговорыКонтрагентов.гф_Заблокирован КАК спр_Заблокирован,
	|	ДоговорыКонтрагентов.гф_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ вт_БлокировкиПоПартнеру
	|ИЗ
	|	ИсключенияБлокировок КАК Блокировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Блокировки.Партнер = ДоговорыКонтрагентов.Партнер
	|ГДЕ
	|	Блокировки.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И НЕ ДоговорыКонтрагентов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Блокировки.нпп_Блокировки КАК нпп_Блокировки,
	|	Блокировки.Период КАК Период,
	|	Блокировки.ДействуетДо КАК ДействуетДо,
	|	Блокировки.Контрагент КАК Контрагент,
	|	Блокировки.Партнер КАК Партнер,
	|	Блокировки.Организация КАК Организация,
	|	Блокировки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Блокировки.ОписаниеБлокировки КАК ОписаниеБлокировки,
	|	Блокировки.Заблокирован КАК Заблокирован,
	|	ДоговорыКонтрагентов.Ссылка КАК спрДоговор,
	|	ДоговорыКонтрагентов.гф_Заблокирован КАК спр_Заблокирован,
	|	ДоговорыКонтрагентов.гф_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ вт_БлокировкиПоОрганизации
	|ИЗ
	|	ИсключенияБлокировок КАК Блокировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Блокировки.Партнер = ДоговорыКонтрагентов.Партнер
	|			И Блокировки.Организация = ДоговорыКонтрагентов.Организация
	|ГДЕ
	|	Блокировки.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	И НЕ ДоговорыКонтрагентов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И НЕ Блокировки.нпп_Блокировки В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т.нпп_Блокировки
	|				ИЗ
	|					вт_БлокировкиПоПартнеру КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Блокировки.нпп_Блокировки КАК нпп_Блокировки,
	|	Блокировки.Период КАК Период,
	|	Блокировки.ДействуетДо КАК ДействуетДо,
	|	Блокировки.Контрагент КАК Контрагент,
	|	Блокировки.Партнер КАК Партнер,
	|	Блокировки.Организация КАК Организация,
	|	Блокировки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Блокировки.ОписаниеБлокировки КАК ОписаниеБлокировки,
	|	Блокировки.Заблокирован КАК Заблокирован,
	|	ДоговорыКонтрагентов.Ссылка КАК спрДоговор,
	|	ДоговорыКонтрагентов.гф_Заблокирован КАК спр_Заблокирован,
	|	ДоговорыКонтрагентов.гф_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ вт_БлокировкиПоДоговорам
	|ИЗ
	|	ИсключенияБлокировок КАК Блокировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Блокировки.Партнер = ДоговорыКонтрагентов.Партнер
	|			И Блокировки.Организация = ДоговорыКонтрагентов.Организация
	|			И Блокировки.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	НЕ Блокировки.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	И НЕ ДоговорыКонтрагентов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И НЕ Блокировки.нпп_Блокировки В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т.нпп_Блокировки
	|				ИЗ
	|					вт_БлокировкиПоПартнеру КАК т)
	|	И НЕ Блокировки.нпп_Блокировки В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т1.нпп_Блокировки
	|				ИЗ
	|					вт_БлокировкиПоОрганизации КАК т1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_БлокировкиПоПартнеру.нпп_Блокировки КАК нпп_Блокировки,
	|	вт_БлокировкиПоПартнеру.Период КАК Период,
	|	вт_БлокировкиПоПартнеру.ДействуетДо КАК ДействуетДо,
	|	вт_БлокировкиПоПартнеру.Контрагент КАК Контрагент,
	|	вт_БлокировкиПоПартнеру.Партнер КАК Партнер,
	|	вт_БлокировкиПоПартнеру.Организация КАК Организация,
	|	вт_БлокировкиПоПартнеру.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	вт_БлокировкиПоПартнеру.ОписаниеБлокировки КАК ОписаниеБлокировки,
	|	вт_БлокировкиПоПартнеру.Заблокирован КАК Заблокирован,
	|	вт_БлокировкиПоПартнеру.спрДоговор КАК спрДоговор,
	|	вт_БлокировкиПоПартнеру.спр_Заблокирован КАК спр_Заблокирован,
	|	вт_БлокировкиПоПартнеру.спр_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ вт_БлокировкиСводно
	|ИЗ
	|	вт_БлокировкиПоПартнеру КАК вт_БлокировкиПоПартнеру
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_БлокировкиПоОрганизации.нпп_Блокировки,
	|	вт_БлокировкиПоОрганизации.Период,
	|	вт_БлокировкиПоОрганизации.ДействуетДо,
	|	вт_БлокировкиПоОрганизации.Контрагент,
	|	вт_БлокировкиПоОрганизации.Партнер,
	|	вт_БлокировкиПоОрганизации.Организация,
	|	вт_БлокировкиПоОрганизации.ДоговорКонтрагента,
	|	вт_БлокировкиПоОрганизации.ОписаниеБлокировки,
	|	вт_БлокировкиПоОрганизации.Заблокирован,
	|	вт_БлокировкиПоОрганизации.спрДоговор,
	|	вт_БлокировкиПоОрганизации.спр_Заблокирован,
	|	вт_БлокировкиПоОрганизации.спр_ОписаниеБлокировки
	|ИЗ
	|	вт_БлокировкиПоОрганизации КАК вт_БлокировкиПоОрганизации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_БлокировкиПоДоговорам.нпп_Блокировки,
	|	вт_БлокировкиПоДоговорам.Период,
	|	вт_БлокировкиПоДоговорам.ДействуетДо,
	|	вт_БлокировкиПоДоговорам.Контрагент,
	|	вт_БлокировкиПоДоговорам.Партнер,
	|	вт_БлокировкиПоДоговорам.Организация,
	|	вт_БлокировкиПоДоговорам.ДоговорКонтрагента,
	|	вт_БлокировкиПоДоговорам.ОписаниеБлокировки,
	|	вт_БлокировкиПоДоговорам.Заблокирован,
	|	вт_БлокировкиПоДоговорам.спрДоговор,
	|	вт_БлокировкиПоДоговорам.спр_Заблокирован,
	|	вт_БлокировкиПоДоговорам.спр_ОписаниеБлокировки
	|ИЗ
	|	вт_БлокировкиПоДоговорам КАК вт_БлокировкиПоДоговорам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_БлокировкиСводно.нпп_Блокировки КАК нпп_Блокировки,
	|	вт_БлокировкиСводно.Период КАК Период,
	|	вт_БлокировкиСводно.Контрагент КАК Контрагент,
	|	вт_БлокировкиСводно.Партнер КАК Партнер,
	|	вт_БлокировкиСводно.Организация КАК Организация,
	|	вт_БлокировкиСводно.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	вт_БлокировкиСводно.ОписаниеБлокировки + "" (исключение до "" + (ВЫРАЗИТЬ(вт_БлокировкиСводно.ДействуетДо КАК СТРОКА(10))) + "")"" КАК ОписаниеБлокировки,
	|	вт_БлокировкиСводно.Заблокирован КАК Заблокирован,
	|	вт_БлокировкиСводно.спрДоговор КАК спрДоговор,
	|	вт_БлокировкиСводно.спр_Заблокирован КАК спр_Заблокирован,
	|	вт_БлокировкиСводно.спр_ОписаниеБлокировки КАК спр_ОписаниеБлокировки
	|ПОМЕСТИТЬ вт_ИтоговыеДанныеПоБлокировкам
	|ИЗ
	|	вт_БлокировкиСводно КАК вт_БлокировкиСводно
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	спрДоговор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКандидат,
	|	вт_ИтоговыеДанныеПоБлокировкам.ОписаниеБлокировки КАК ОписаниеБлокировки
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ИтоговыеДанныеПоБлокировкам КАК вт_ИтоговыеДанныеПоБлокировкам
	|		ПО ДоговорыКонтрагентов.Ссылка = вт_ИтоговыеДанныеПоБлокировкам.спрДоговор
	|ГДЕ
	|	ДоговорыКонтрагентов.Партнер = &Партнер
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И НЕ ДоговорыКонтрагентов.гф_Сезон = ЗНАЧЕНИЕ(Справочник.КоллекцииНоменклатуры.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Период", Период);
	Результат = Запрос.Выполнить();
	тзПоИсключениямПоПартнеру = Результат.Выгрузить();
	Возврат тзПоИсключениямПоПартнеру;
КонецФункции // ^^^ Галфинд \ Sakovich 13.03.2024


 #КонецОбласти
